{
  "acts": [
    {
      "title": "Act I: The Blighted Bloom",
      "summary": "Strange afflictions plague the quiet village of Oakhaven: crops wither, livestock sicken, and villagers fall into a disturbing 'dream-sickness.' The source is traced to the nearby Murky Fen, where a vile corruption has taken root, threatening to consume everything.",
      "locations": [
        "Oakhaven Village",
        "The Murky Fen",
        "The Hermitage of Elara"
      ],
      "battle": {
        "enemy": "Grasping Mire Horror",
        "enemy_type": "Plant/Aberration",
        "challenge_rating": "CR 4 (Party Levels 3-4)",
        "description": "A grotesque tangle of mutated roots, vines, and corrupted bog matter, animated by the fen's blight. It guards a pulsating, blighted heart of the corruption.",
        "twist": "The creature is vulnerable to radiant energy or direct sunlight, which causes its limbs to shrivel. However, the battlefield is shrouded in thick, acidic mist that provides disadvantage on ranged attacks and deals necrotic damage to those who start their turn in it."
      }
    },
    {
      "title": "Act II: Whispers from the Deep",
      "summary": "The source of the fen's corruption is revealed to be ancient, aberrant energy emanating from the nearby Lake Eldoria. As the party investigates, ancient ruins begin to surface from the lake's depths, drawing the attention of scholarly factions and sinister cultists alike, all seeking the power within.",
      "locations": [
        "Port Eldoria (Thriving Lakeside City)",
        "The Sunken City Outskirts (Emerging Ruins)",
        "The Scribe's Conclave Library"
      ],
      "battle": {
        "enemy": "Abyssal Cultist Invocator & Corrupted Water Elementals",
        "enemy_type": "Humanoid (Spellcaster) & Elemental",
        "challenge_rating": "CR 8 (Party Levels 7-8)",
        "description": "A powerful cult leader attempting to open a portal to the abyssal depths within a partially submerged temple chamber, aided by coalesced forms of corrupted lake water.",
        "twist": "The Invocator's ritual causes unstable energy surges, randomly empowering the elementals or creating temporary areas of difficult terrain/damage. Interrupting the ritual too early might destabilize the temple, causing sections to collapse or flood."
      }
    },
    {
      "title": "Act III: The Obsidian Heart",
      "summary": "Having delved deep into the Sunken City, the party uncovers the terrible truth: an ancient, aberrant entity, known as the 'Drowned Sovereign,' was imprisoned here eons ago, and its awakening is causing the widespread blight. The party must now venture to the city's core, a monstrous 'Obsidian Heart,' to either re-seal or destroy the entity before it fully emerges.",
      "locations": [
        "The Obsidian Citadel (Central Spire)",
        "The Chamber of Whispering Glyphs",
        "The Drowned Sovereign's Throne Room"
      ],
      "battle": {
        "enemy": "The Drowned Sovereign (Ancient Aberrant Entity)",
        "enemy_type": "Aberration/Cosmic Horror",
        "challenge_rating": "CR 13 (Party Levels 12-14)",
        "description": "The true form of the Drowned Sovereign is a multi-tentacled, telepathic horror that warps reality around it. The battle takes place in its throne room, which is slowly filling with dark, corrosive water.",
        "twist": "The Sovereign cannot be defeated by brute force alone. Its regeneration is immense unless ancient power conduits (four in the room) are simultaneously overloaded or re-calibrated during combat, requiring complex skill checks and coordinated actions. Failure to do so by the time the room completely floods results in a near-impossible fight or a TPK."
      }
    }
  ]
}